'''

Підказка: Що відбувається, коли ми звертаємося по ключу word_count["apple"], якого в словнику ще взагалі немає?
Як правильно перевірити наявність ключа в словнику?

Завдання 4: Небезпечний аргумент за замовчуванням
Сценарій: Функція створює список завдань (To-Do list).
Якщо список не передано, вона має створювати новий порожній список.
Але чомусь завдання різних користувачів змішуються в один кошик!
'''


def add_task(task, task_list = None):
    if task_list is None:
        task_list = []

    task_list.append(task)
    return task_list

# Юзер 1 додає задачу
user1_tasks = add_task("Купити хліб")
print("User 1:", user1_tasks) # Виводить: ['Купити хліб']

# Юзер 2 додає задачу
user2_tasks = add_task("Помити машину")
print("User 2:", user2_tasks) # Очікуємо: ['Помити машину'], а виводить обидві!



'''
Підказка: Мутабельні об'єкти (як-от списки чи словники) як аргументи за замовчуванням в Python створюються один раз під час ініціалізації функції, а не при кожному її виклику. 
Як це виправити через None?
'''
