'''
Завдання 6: Нескінченний підрахунок (Тема: Цикли while)
Сценарій: Програма має зменшувати лічильник на 0.5 на кожній ітерації, поки він не стане рівним нулю. Але цикл перетворюється на нескінченний і забиває термінал.
'''

countdown = 3
while countdown >= 0:
    print(countdown)
    countdown -= 0.3 # Зменшуємо крок

'''Підказка: Справа в особливостях збереження чисел із плаваючою крапкою (float) у пам'яті комп'ютера. 
Чи дійсно countdown колись буде точно дорівнювати 0.0? Яку умову краще використати у while?
'''
