'''
Задача 6: Оцінка на іспиті
Програма запитує кількість балів за стобальною шкалою і виводить оцінку:

90-100 — "Відмінно"

75-89 — "Добре"

60-74 — "Задовільно"

Менше 60 — "Незадовільно"

Якщо число менше 0 або більше 100 — вивести "Помилка: некоректні дані".
'''


user_grade = int(input("Please enter your grade (from 0 to 100): "))

if 90 <= user_grade <= 100:
    print("Відмінно")
elif 75 <= user_grade < 90:
    print("Добре")
elif 60 <= user_grade < 75:
    print("Задовільно")
elif 0 <= user_grade < 60:
    print("Незадовільно")
else:
    print("Enter your valid grade")