# tuple
#
# Перевірка наявності
#
# Умова: Створи кортеж із п'яти різних кольорів. Напиши перевірку, яка з'ясовує, чи є колір "зелений" у цьому кортежі,
# і виводить "Так" або "Ні".
#
# Підказка: Використовуй оператор умови if та ключове слово in для перевірки наявності елемента.


colors = ("червоний", "синій", "зелений","жовтий","фіолетовий")

if "зелений" in colors:
    print("Так")
else:
    print("Ні")




"""
task 12 was written correctly, without any mistakes. But as an advice you can also write IF-part in print:

print("Так" if "зелений" in colors else "Ні") 
"""

