#Задача 3: Парні та непарні (Введення до нуля)
#Користувач вводить з клавіатури цілі числа одне за одним.
#Процес зупиняється лише тоді, коли користувач введе 0.
#Після цього програма має вивести дві цифри: скільки серед введених чисел було парних,
#а скільки — непарних (сам нуль рахувати не треба).

count_even = 0
count_odd = 0
while True:
    x = int(input("Введіть ціле число: "))
    if x == 0:
        break
    elif x % 2 == 0:
            count_even += 1
    else:
        count_odd += 1

print('Парних чисел:', count_even, ', непарних чисел:', count_odd)

