# Завдання 22: Неслухняний кортеж (Тема: Імутабельність)
# Сценарій: Ми зберігаємо координати точки на карті у вигляді кортежу (x, y).
# Нам потрібно оновити координату x. Але код викликає помилку TypeError.


point = (10, 20)
# Нам треба змінити першу координату на 15
point = (15, point[1])
print(point)

"Занадто простий код та вручну написаний елемент 15"


point = (10, 20)

x, y = point
x = point[0] + 5
point = (x, y)

print(point)

"А цей варіант як для мене більш читальніший за твій"

"by Iakov"