# set
#
# Забудь старе
#
# Умова: Створи множину зі своїх поточних завдань на день.
# Одне завдання ти вже виконав. Видали його з множини так, щоб програма не видавала помилку,
# навіть якщо цього завдання там раптом не виявиться.
#
# Підказка: Метод .remove() викличе помилку KeyError, якщо елемента немає.
# Тому краще безпечно використовувати метод .discard(елемент).

task_list = {"Прокинутися","Поїсти","Пограти 13 годин без перерв","Попити","Зробити сальто","Поспати",}

task_list.discard("Не грати")
task_list.discard("Пограти 13 годин без перерв")