Зрозумів, тримай чисті текстові задачі на умови та цикли. Ніякого готового коду, тільки умови,
які треба реалізувати з нуля.
Задача 1: Калькулятор знижок
Напиши програму, яка запитує у користувача суму покупки.
Якщо сума більша за 1000 грн, нараховується знижка 10%.
Якщо сума більша за 5000 грн, знижка становить 15%.
В інших випадках знижки немає. Програма має вивести кінцеву суму до сплати.


price = float(input("Введіть суму покупки:"))

if price > 5000:
    discount_percent = 15
elif price > 1000:
    discount_percent = 10
else:
    discount_percent = 0

discount = price * discount_percent / 100
final_price = price - discount

print("Знижка:" discount)
print("До сплати:", final_price)
 #