from Volodymyr.myclass import print_number

# Задача 9: Гра «Вгадай число»
# Програма «загадує» число від 1 до 50 (можна просто записати його в змінну). Користувач намагається його вгадати.
# Якщо введене користувачем число більше за загадане —
# програма пише «Забагато», якщо менше — «Замало». Гра триває в циклі, поки користувач не вгадає число.


secret_number = 27

guess = int(input("Введіть число від 1 до 50:"))

while guess != secret_number:
    if guess > secret_number:
        print("Забагато")
    else:
        print("Замало")

    guess = int(input("Спробуй ще раз:"))
print("Ти вгадав!")
#