
1. Унікальні гості
Умова: Створи список із імен гостей, які прийшли на вечірку (деякі імена можуть повторюватися).
Додай до кінця списку ще одне ім'я новоприбулого гостя та виведи загальну кількість елементів.
Підказка: Використовуй метод .append() для додавання елемента та функцію len() для підрахунку.


guests = ["Оля", "Іван", "Марія", "Іван", "Петро"]

new_guest = input("Введіть ім'я нового гостя: ")

guests.append(new_guest)

print("Список гостей:", guests)
print("Загальна кількість елементів:", len(guests))