# Координати точки
#
# Умова: Створи кортеж, який зберігає координати об'єкта на карті (широту та довготу).
# Спробуй змінити перше значення. Оброби помилку або переконайся, що Python цього не дозволить.
# Підказка: Кортежі незмінні (immutable). Щоб "змінити" його, доведеться створити новий кортеж або
# просто вивести старий через print().
def mytuple(phi, lam):
    myt = (phi, lam)
    try:
        myt[0] = 98765.87
    except Exception:
        print('Не можливо змінити кортеж!')
        return 98765.87, lam

newtuple = mytuple(34567.34, 45678.45)
print('Зміна координати в новому кортежі: ', newtuple)